add graphs to visual architecture better
